Repository: dcmits/ListFlow
Catalog: Update/Properties/Resources.*.resx
Languages: fr_fr

# ToolTip_MandatoryField
source: Mandatory field
fr_fr: Champ obligatoire

# ToolTip_Close
source: Close
fr_fr: Fermer

# ViewTitle_Update
source: Update
fr_fr: Mise à jour

# Info_XMLFileUnavailable
source: The XML file containing the parameters of the operations to be performed during the update is not available.
fr_fr: Le fichier XML contenant les paramètres des opérations à effectuer lors de la mise à jour n'est pas accessible.

# Info_XMLFilePath
source: XML File:
fr_fr: Fichier XML :

# Info_UpdateCannotBePerformed
source: The update cannot be performed !
fr_fr: La mise à jour ne peux être effectuée!

# Info_ContactSupport
source: Please contact support.
fr_fr: Veuillez contacter le service d'assistance.

# Button_Update
source: _Update
fr_fr: _Mettre à jour

# Button_Close
source: _Close
fr_fr: _Fermer

# Button_Quit
source: _Exit
fr_fr: _Quitter

# Button_Cancel
source: C_ancel
fr_fr: _Annuler

# Info_XMLParse
source: An error occurred while reading the XML file containing the parameters of the operations to be performed during the update.
fr_fr: Une erreur est survenue lors de la lecture du fichier XML contenant les paramètres des opérations à effectuer lors de la mise à jour.

# Info_Exception
source: Error message:
fr_fr: Message d'erreur:

# Info_BeforeUpdate
source: Click '{0}' to install SeatFlow version {1}.
fr_fr: Cliquer sur '{0}' pour installer la version {1} de SeatFlow.

# Info_WrongVersion
source: The current SeatFlow release '{0}' does not match the updatable release '{1}'.
fr_fr: La version courante de SeatFlow '{0}' ne correspond pas à la version pouvant être mise à jour '{1}'.

# Action_UpdateStarted
source: Start the installation of the update from version '{0}' to version '{1}'.
fr_fr: Lancement de l'installation de la mise à jour de la version '{0}' vers la version '{1}'.

# Action_ReplaceFile
source: Replace the file '{0}' with its new version.
fr_fr: Remplace le fichier '{0}' par sa nouvelle version.

# Action_ReplaceFileError
source: An error occurred while replacing the file '{0}'.
fr_fr: Une erreur est survenue lors du remplacement du fichier {0}.

# Action_UpdateAborted
source: The update is aborted!
fr_fr: La mise à jour est interrompue!

# Action_ErrorCode
source: Error message: {0}
fr_fr: Message d'erreur: {0}

# Action_BackupFolderError
source: Unable to create the target folder '{0}' for data backup before update.
fr_fr: Impossible de créer le dossier cible '{0}' pour la sauvegarde des données avant mise à jour.

# Action_BackupFolder
source: Folder:
fr_fr: Dossier:

# Action_CreateBackupFolder
source: Create the data backup folder '{0}'.
fr_fr: Création du dossier de sauvegarde des données '{0}'.

# Action_File
source: File:
fr_fr: Fichier:

# Action_BackupData
source: Create a backup of the data file '{0}' as '{1}'.
fr_fr: Crée une sauvegarde du fichier de données '{0}' sous '{1}'.

# Action_CopyFileError
source: The creation of the backup copy '{0}' of the file '{1}' has failed.
fr_fr: La création de la copie de sauvegarde '{0}' du fichier '{1}' a échouée.

# Action_FileNotFound
source: Unable to find the data file '{0}'.
fr_fr: Impossible de trouver le fichier de données '{0}'.

# Action_BackupDataBeforeUpdate
source: Backup of data before updating.
fr_fr: Sauvegarde des données avant mise à jour.

# Action_GetDataPath
source: Extract the path to the data file from exe.config file.
fr_fr: Extrait le chemin d'accès au fichier de données du fichier de configuration exe.config.

# Action_ConfigFileElementError
source: Unable to find the '{0}' item in the '{1}' configuration file.
fr_fr: Impossible de trouver l'élément '{0}' dans le fichier de configuration '{1}'.

# Action_XmlError
source: An XML error occurred while reading the file '{0}'.
fr_fr: Une erreur XML est survenue lors de la lecture du fichier '{0}'.

# Action_DataFilePath
source: XML data file: {0}
fr_fr: Fichier de données XML: {0}

# Action_GetSchemaPath
source: Extract the path to the schema file from data file.
fr_fr: Extrait le chemin d'accès au fichier du schéma des données du fichier de données.

# Action_SchemaFilePath
source: XSD schema file from XML data: {0}
fr_fr: Fichier XSD de schéma des données XML: {0}

# Action_XMLElementError
source: Unable to find the '{0}' item in the '{1}' XML file.
fr_fr: Impossible de trouver l'élément '{0}' dans le fichier XML '{1}'.

# Action_BackupSchemaBeforeUpdate
source: Backup schema before updating.
fr_fr: Sauvegarde le schéma avant mise à jour.

# Action_BackupSchema
source: Create a backup of the schema file '{0}' as '{1}'.
fr_fr: Crée une sauvegarde du fichier du schéma '{0}' sous '{1}'.

# Action_ReplaceSchemaFile
source: Replace the XSD data schema file '{0}' with the new version.
fr_fr: Remplace le fichier XSD '{0}' du schéma des données par la nouvelle version.

# Action_ReplaceSchema
source: Replace the data schema.
fr_fr: Remplace le schéma des données.

# Action_UpdateData
source: Updating data.
fr_fr: Mise à jour des données.

# Action_UpdateElement
source: Updating '{0}' elements.
fr_fr: Mise à jour des éléments '{0}'.

# Action_UpdatedSuccessfully
source: Update successfully completed.
fr_fr: Mise à jour terminée avec succès.

# Action_RestartSeatFlow
source: You can restart SeatFlow.
fr_fr: Vous pouvez redémarrer SeatFlow.

# Action_DeleteUdpateFiles
source: Delete all files used for the update.
fr_fr: Supprime tous les fichiers utilisés pour la mise à jour.

# Info_AppNotFound
source: The SeatFlow application is not installed in the '{0}' folder.
fr_fr: L'application SeatFlow n'est pas installée dans le dossier '{0}'.

# Action_NewSchemaNameNotFound
source: The path to the new XSD schema is not defined in the update parameter file.
fr_fr: Le chemin d'accès au nouveau schéma XSD n'est pas définit dans le fichier de paramétrage de la mise à jour.

# Info_UpdateEndedSuccessfully
source: Version '{0}' of SeatFlow has been successfully installed.
fr_fr: La version '{0}' de SeatFlow a été installé avec succès.

# Info_RestartSeatFlow
source: You can restart SeatFlow.
fr_fr: Vous pouvez redémarrer SeatFlow.

# Info_UpdateAborted
source: The update did not successfully complete.
fr_fr: La mise à jour ne s'est pas terminée correctement.
